// 1. Напишите функцию, которая принимает три числовых параметра и возвращает произведение двух максимальных из них.
const a = Number(prompt('Введите число 1: '));
const b = Number(prompt('Введите число 2: '));
const c = Number(prompt('Введите число 3: '));

if (isNaN(a) || isNaN(b) || isNaN(c)) {
  alert('Ошибка: Введите корректные числа!');
} else {
  alert('Произведение равно: ' + getMaxValue(a, b, c));
}

function getMaxValue(a, b, c){
  const arr = [a,b,c];
  arr.sort((x, y) => y - x);
  return arr[0] * arr[1];
}

/* 2. Объявите функцию, которая принимает на вход два параметра: 
имя и звание. Значение звания по умолчанию «рядовой».
Продемонстрируйте вариант использования функции с передачей 
1 и 2 параметров. */

// 2. Функция с параметром по умолчанию
function greet(name, rank = "рядовой") {
  console.log(`Здравствуйте, ${rank} ${name}`);
}

// Вызовы функции
const name1 = prompt('Введите имя:');
greet(name1);
const name2 = prompt('Введите имя:');
const rank = prompt('Введите звание (по умолчанию рядовой):') || 'рядовой';
greet(name2, rank);